src/cf/Catalogs/Метрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Метрики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйМасштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗамеров</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Метрики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ, СтандартнаяОбработка)
	
	Элементы.Выражение.ТолькоПросмотр = Объект.Предопределенный;
	ВывестиПериодВСутках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗамеровПриИзменении(Элемент)
	
	ВывестиПериодВСутках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПериодВСутках()
	
	Текст = НСтр("ru = 'минут'");
	
	Если Объект.ПериодЗамеров >= 600 Тогда
		КолСуток = Окр(Объект.ПериодЗамеров / 1440, 2);
		Текст = Текст + " (" + "" + КолСуток + " " + 
			?(КолСуток = 1, НСтр("ru = 'сутки'"), НСтр("ru = 'суток'")) + ")";
	КонецЕсли;
	
	Элементы.ПериодЗамеровЕдИзм.Заголовок = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьРезультат(Команда)
	
	Результат = ВычислитьРезультатНаСервере();
	ПоказатьЗначение(, Результат);
	
КонецПроцедуры

&НаСервере
Функция ВычислитьРезультатНаСервере()
	
	Возврат Метрики.ПолучитьРезультатЗамера(Объект.Ссылка, Объект.Выражение);
	
КонецФункции
